---
kind: other
id: Properties.T:Autodesk.Revit.DB.BuiltInFailures.PlanRegionFailures
source: html/54f0e6a7-124f-872a-88fc-d85a46c518a5.htm
---
# BuiltInFailures.PlanRegionFailures Properties

Deleted level was used to define plan region's view range.\r\nReplace deleted level by level of parent view and adjust offset?